lixpaulian/efr32xx-rail/submodules/emlib/src/em_cmu.c
  switch (selRegId)
  {
    case CMU_HFCLKSEL_REG:
      switch (ref)
      {
        case cmuSelect_LFXO:
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
          select = CMU_HFCLKSEL_HF_LFXO;
#elif defined( _SILICON_LABS_32B_PLATFORM_1 )
          select = CMU_CMD_HFCLKSEL_LFXO;
#endif
          osc = cmuOsc_LFXO;
          break;

        case cmuSelect_LFRCO:
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
          select = CMU_HFCLKSEL_HF_LFRCO;
#elif defined( _SILICON_LABS_32B_PLATFORM_1 )
          select = CMU_CMD_HFCLKSEL_LFRCO;
#endif
          osc = cmuOsc_LFRCO;
          break;

        case cmuSelect_HFXO:
          osc = cmuOsc_HFXO;
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
          select = CMU_HFCLKSEL_HF_HFXO;
          /* Adjust HFXO buffer current for high frequencies, */
          /* enable WSHFLE for frequencies above 32MHz.       */
          if (SystemHFXOClockGet() > 32000000)
          {
            CMU->CTRL |= CMU_CTRL_WSHFLE;
          }
#elif defined( _SILICON_LABS_32B_PLATFORM_1 )
          select = CMU_CMD_HFCLKSEL_HFXO;
#if defined( CMU_CTRL_HFLE )
          /* Adjust HFXO buffer current for high frequencies,     */
          /* enable HFLE for frequencies above CMU_MAX_FREQ_HFLE. */
          if(SystemHFXOClockGet() > CMU_MAX_FREQ_HFLE())
          {
            CMU->CTRL = (CMU->CTRL & ~_CMU_CTRL_HFXOBUFCUR_MASK)
                        | CMU_CTRL_HFXOBUFCUR_BOOSTABOVE32MHZ
            /* Must have HFLE enabled to access some LE peripherals >=32MHz */
                        | CMU_CTRL_HFLE;

            /* Set HFLE and DIV4 factor for peripheral clock if HFCORE  */
            /* clock for LE is enabled.                                 */
            if (CMU->HFCORECLKEN0 & CMU_HFCORECLKEN0_LE)
            {
              BUS_RegBitWrite(&CMU->HFCORECLKDIV,
                              _CMU_HFCORECLKDIV_HFCORECLKLEDIV_SHIFT, 1);
            }
          }
          else
          {
            /* This can happen if the user configures the EFM32_HFXO_FREQ to */
            /* use another oscillator frequency */
            CMU->CTRL = (CMU->CTRL & ~_CMU_CTRL_HFXOBUFCUR_MASK)
                        | CMU_CTRL_HFXOBUFCUR_BOOSTUPTO32MHZ;
          }
#endif
#endif
          break;

        case cmuSelect_HFRCO:
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
          select = CMU_HFCLKSEL_HF_HFRCO;
#elif defined( _SILICON_LABS_32B_PLATFORM_1 )
          select = CMU_CMD_HFCLKSEL_HFRCO;
#endif
          osc = cmuOsc_HFRCO;
          break;

#if defined( CMU_CMD_HFCLKSEL_USHFRCODIV2 )
        case cmuSelect_USHFRCODIV2:
          select = CMU_CMD_HFCLKSEL_USHFRCODIV2;
          osc = cmuOsc_USHFRCO;
          break;
#endif

#if defined( CMU_LFCLKSEL_LFAE_ULFRCO ) || defined( CMU_LFACLKSEL_LFA_ULFRCO )
        case cmuSelect_ULFRCO:
          /* ULFRCO cannot be used as HFCLK  */
          EFM_ASSERT(0);
          return;
#endif

        default:
          EFM_ASSERT(0);
          return;
      }

      /* Ensure selected oscillator is enabled, waiting for it to stabilize */
      CMU_OscillatorEnable(osc, true, true);

      /* Configure worst case wait states for flash access before selecting */
      flashWaitStateMax();

      /* Switch to selected oscillator */
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
      CMU->HFCLKSEL = select;
#elif defined( _SILICON_LABS_32B_PLATFORM_1 )
      CMU->CMD = select;
#endif

      /* Keep EMU module informed */
      EMU_UpdateOscConfig();

      /* Update CMSIS core clock variable */
      /* (The function will update the global variable) */
      freq = SystemCoreClockGet();

      /* Optimize flash access wait state setting for currently selected core clk */
      flashWaitStateControl(freq);
      break;

#if defined( _SILICON_LABS_32B_PLATFORM_2 )
    case CMU_LFACLKSEL_REG:
      selReg = (selReg == NULL) ? &CMU->LFACLKSEL : selReg;
#if !defined( _CMU_LFACLKSEL_LFA_HFCLKLE )
      /* HFCLKCLE can not be used as LFACLK */
      EFM_ASSERT(ref != cmuSelect_HFCLKLE);
#endif
      /* no break [LNP] */
    case CMU_LFECLKSEL_REG:
      selReg = (selReg == NULL) ? &CMU->LFECLKSEL : selReg;
#if !defined( _CMU_LFECLKSEL_LFE_HFCLKLE )
      /* HFCLKCLE can not be used as LFECLK */
      EFM_ASSERT(ref != cmuSelect_HFCLKLE);
#endif
      /* no break [LNP] */
    case CMU_LFBCLKSEL_REG:
      selReg = (selReg == NULL) ? &CMU->LFBCLKSEL : selReg;
      switch (ref)
      {
        case cmuSelect_Disabled:
          tmp = _CMU_LFACLKSEL_LFA_DISABLED;
          break;

        case cmuSelect_LFXO:
          /* Ensure selected oscillator is enabled, waiting for it to stabilize */
          CMU_OscillatorEnable(cmuOsc_LFXO, true, true);
          tmp = _CMU_LFACLKSEL_LFA_LFXO;
          break;

        case cmuSelect_LFRCO:
          /* Ensure selected oscillator is enabled, waiting for it to stabilize */
          CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);
          tmp = _CMU_LFACLKSEL_LFA_LFRCO;
          break;

        case cmuSelect_HFCLKLE:
          /* Ensure HFCORE to LE clocking is enabled */
          BUS_RegBitWrite(&CMU->HFBUSCLKEN0, _CMU_HFBUSCLKEN0_LE_SHIFT, 1);
          tmp = _CMU_LFBCLKSEL_LFB_HFCLKLE;

          /* If core frequency is > 32MHz enable WSHFLE */
          freq = SystemCoreClockGet();
          if (freq > 32000000U)
          {
            /* Enable CMU HFLE */
            BUS_RegBitWrite(&CMU->CTRL, _CMU_CTRL_WSHFLE_SHIFT, 1);

            /* Enable DIV4 factor for peripheral clock */
            BUS_RegBitWrite(&CMU->HFPRESC, _CMU_HFPRESC_HFCLKLEPRESC_SHIFT, 1);
          }
          break;

        case cmuSelect_ULFRCO:
          /* ULFRCO is always on, there is no need to enable it. */
          tmp = _CMU_LFACLKSEL_LFA_ULFRCO;
          break;

        default:
          EFM_ASSERT(0);
          return;
      }
      *selReg = tmp;
      break;

#elif defined( _SILICON_LABS_32B_PLATFORM_1 )
    case CMU_LFACLKSEL_REG:
    case CMU_LFBCLKSEL_REG:
      switch (ref)
      {
        case cmuSelect_Disabled:
          tmp = _CMU_LFCLKSEL_LFA_DISABLED;
          break;

