lixpaulian/efr32xx-rail/submodules/emlib/src/em_cmu.c
  /* Set XTAL tuning parameters */

  /* Set peak detection threshold in CMU_HFXOCTRL1_PEAKDETTHR[2:0] (hidden). */
  BUS_RegMaskedWrite((volatile uint32_t *)0x400E4028, 0x7, hfxoInit->thresholdPeakDetect);

  /* Set tuning for startup and steady state */
  BUS_RegMaskedWrite(&CMU->HFXOSTARTUPCTRL,
                     _CMU_HFXOSTARTUPCTRL_CTUNE_MASK
                     | _CMU_HFXOSTARTUPCTRL_REGISHWARM_MASK
                     | _CMU_HFXOSTARTUPCTRL_IBTRIMXOCORE_MASK
                     | _CMU_HFXOSTARTUPCTRL_IBTRIMXOCOREWARM_MASK,
                     (hfxoInit->ctuneStartup
                      << _CMU_HFXOSTARTUPCTRL_CTUNE_SHIFT)
                     | (hfxoInit->regIshStartup
                        << _CMU_HFXOSTARTUPCTRL_REGISHWARM_SHIFT)
                     | (hfxoInit->xoCoreBiasTrimStartup
                        << _CMU_HFXOSTARTUPCTRL_IBTRIMXOCORE_SHIFT)
                     | 0x4 /* Recommended tuning */
                        << _CMU_HFXOSTARTUPCTRL_IBTRIMXOCOREWARM_SHIFT);

  /* Adjust CMU_HFXOSTEADYSTATECTRL_REGISHUPPER according to regIshSteadyState.
     Saturate at max value. Please see the reference manual page 433 and Section
     12.5.10 CMU_HFXOSTEADYSTATECTRL for more details. */
  ishReg = hfxoInit->regIshSteadyState + 3;
  ishMax = _CMU_HFXOSTEADYSTATECTRL_REGISHUPPER_MASK
            >> _CMU_HFXOSTEADYSTATECTRL_REGISHUPPER_SHIFT;
  ishReg = ishReg > ishMax ? ishMax : ishReg;
  ishReg <<= _CMU_HFXOSTEADYSTATECTRL_REGISHUPPER_SHIFT;

  BUS_RegMaskedWrite(&CMU->HFXOSTEADYSTATECTRL,
                     _CMU_HFXOSTEADYSTATECTRL_CTUNE_MASK
                     | _CMU_HFXOSTEADYSTATECTRL_REGISH_MASK
                     | _CMU_HFXOSTEADYSTATECTRL_IBTRIMXOCORE_MASK
                     | _CMU_HFXOSTEADYSTATECTRL_REGISHUPPER_MASK,
                     (hfxoInit->ctuneSteadyState
                      << _CMU_HFXOSTEADYSTATECTRL_CTUNE_SHIFT)
                     | (hfxoInit->regIshSteadyState
                        << _CMU_HFXOSTEADYSTATECTRL_REGISH_SHIFT)
                     | (hfxoInit->xoCoreBiasTrimSteadyState
                        << _CMU_HFXOSTEADYSTATECTRL_IBTRIMXOCORE_SHIFT)
                     | ishReg);

  /* Set timeouts */
  BUS_RegMaskedWrite(&CMU->HFXOTIMEOUTCTRL,
                     _CMU_HFXOTIMEOUTCTRL_SHUNTOPTTIMEOUT_MASK
                     | _CMU_HFXOTIMEOUTCTRL_PEAKDETTIMEOUT_MASK
                     | _CMU_HFXOTIMEOUTCTRL_WARMSTEADYTIMEOUT_MASK
                     | _CMU_HFXOTIMEOUTCTRL_STEADYTIMEOUT_MASK
                     | _CMU_HFXOTIMEOUTCTRL_STARTUPTIMEOUT_MASK,
                     (hfxoInit->timeoutShuntOptimization
                      << _CMU_HFXOTIMEOUTCTRL_SHUNTOPTTIMEOUT_SHIFT)
                     | (hfxoInit->timeoutPeakDetect
                        << _CMU_HFXOTIMEOUTCTRL_PEAKDETTIMEOUT_SHIFT)
                     | (hfxoInit->timeoutWarmSteady
                        << _CMU_HFXOTIMEOUTCTRL_WARMSTEADYTIMEOUT_SHIFT)
                     | (hfxoInit->timeoutSteady
                        << _CMU_HFXOTIMEOUTCTRL_STEADYTIMEOUT_SHIFT)
                     | (hfxoInit->timeoutStartup
                        << _CMU_HFXOTIMEOUTCTRL_STARTUPTIMEOUT_SHIFT));
}
#endif


/***************************************************************************//**
 * @brief
 *   Get the LCD framerate divisor (FDIV) setting.
 *
 * @return
 *   The LCD framerate divisor.
 ******************************************************************************/
uint32_t CMU_LCDClkFDIVGet(void)
{
#if defined( LCD_PRESENT )
  return (CMU->LCDCTRL & _CMU_LCDCTRL_FDIV_MASK) >> _CMU_LCDCTRL_FDIV_SHIFT;
#else
  return 0;
#endif /* defined(LCD_PRESENT) */
}


/***************************************************************************//**
 * @brief
 *   Set the LCD framerate divisor (FDIV) setting.
 *
 * @note
 *   The FDIV field (CMU LCDCTRL register) should only be modified while the
 *   LCD module is clock disabled (CMU LFACLKEN0.LCD bit is 0). This function
 *   will NOT modify FDIV if the LCD module clock is enabled. Please refer to
 *   CMU_ClockEnable() for disabling/enabling LCD clock.
 *
 * @param[in] div
 *   The FDIV setting to use.
 ******************************************************************************/
void CMU_LCDClkFDIVSet(uint32_t div)
{
#if defined( LCD_PRESENT )
  EFM_ASSERT(div <= cmuClkDiv_128);

  /* Do not allow modification if LCD clock enabled */
  if (CMU->LFACLKEN0 & CMU_LFACLKEN0_LCD)
  {
    return;
  }

  div        <<= _CMU_LCDCTRL_FDIV_SHIFT;
  div         &= _CMU_LCDCTRL_FDIV_MASK;
  CMU->LCDCTRL = (CMU->LCDCTRL & ~_CMU_LCDCTRL_FDIV_MASK) | div;
#else
  (void)div;  /* Unused parameter */
#endif /* defined(LCD_PRESENT) */
}


#if defined( _CMU_LFXOCTRL_MASK )
/**************************************************************************//**
 * @brief
 *   Set LFXO control registers
 *
 * @note
 *   LFXO configuration should be obtained from a configuration tool,
 *   app note or xtal datasheet. This function disables the LFXO to ensure
 *   a valid state before update.
 *
 * @param[in] lfxoInit
 *    LFXO setup parameters
 *****************************************************************************/
void CMU_LFXOInit(CMU_LFXOInit_TypeDef *lfxoInit)
{
  /* Do not disable LFXO if it is currently selected as HF/Core clock */
  EFM_ASSERT(CMU_ClockSelectGet(cmuClock_HF) != cmuSelect_LFXO);

  /* LFXO must be disabled before reconfiguration */
  CMU_OscillatorEnable(cmuOsc_LFXO, false, false);

  BUS_RegMaskedWrite(&CMU->LFXOCTRL,
                     _CMU_LFXOCTRL_TUNING_MASK
                     | _CMU_LFXOCTRL_GAIN_MASK
                     | _CMU_LFXOCTRL_TIMEOUT_MASK,
                     (lfxoInit->ctune << _CMU_LFXOCTRL_TUNING_SHIFT)
                     | (lfxoInit->gain << _CMU_LFXOCTRL_GAIN_SHIFT)
                     | (lfxoInit->timeout << _CMU_LFXOCTRL_TIMEOUT_SHIFT));
}
#endif


/***************************************************************************//**
 * @brief
 *   Enable/disable oscillator.
 *
 * @note
 *   WARNING: When this function is called to disable either cmuOsc_LFXO or
 *   cmuOsc_HFXO the LFXOMODE or HFXOMODE fields of the CMU_CTRL register
 *   are reset to the reset value. I.e. if external clock sources are selected
 *   in either LFXOMODE or HFXOMODE fields, the configuration will be cleared
 *   and needs to be reconfigured if needed later.
 *
 * @param[in] osc
 *   The oscillator to enable/disable.
 *
 * @param[in] enable
 *   @li true - enable specified oscillator.
 *   @li false - disable specified oscillator.
 *
 * @param[in] wait
 *   Only used if @p enable is true.
 *   @li true - wait for oscillator start-up time to timeout before returning.
 *   @li false - do not wait for oscillator start-up time to timeout before
 *     returning.
 ******************************************************************************/
void CMU_OscillatorEnable(CMU_Osc_TypeDef osc, bool enable, bool wait)
{
  uint32_t rdyBitPos;
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
  uint32_t ensBitPos;
#endif
  uint32_t enBit;
  uint32_t disBit;

  switch (osc)
  {
    case cmuOsc_HFRCO:
      enBit  = CMU_OSCENCMD_HFRCOEN;
      disBit = CMU_OSCENCMD_HFRCODIS;
      rdyBitPos = _CMU_STATUS_HFRCORDY_SHIFT;
#if defined( _SILICON_LABS_32B_PLATFORM_2 )
      ensBitPos = _CMU_STATUS_HFRCOENS_SHIFT;
#endif
      break;

